In [1]:
#If the DF gets bigger, it is important to keep these in mind

import pandas as pd

df = pd.read_csv('/Users/conniekeum/Desktop/JupyterNotebook_LEARN/world_cities.csv')
df

     Unnamed: 0 City / Urban area     Country  Population  Land area (in sqKm)
0             0      Buenos Aires   Argentina    11200000                 2266
1             1         Melbourne   Australia     3162000                 2080
2             2            Sydney   Australia     3502000                 1687
3             3          Brisbane   Australia     1508000                 1603
4             4             Perth   Australia     1177000                  964
..          ...               ...         ...         ...                  ...
244         245            Canton         USA      267000                  372
245         246           Spokane         USA      335000                  371
246         247          Tashkent  Uzbekistan     2200000                  531
247         248  Ho Chi Minh City     Vietnam     4900000                  518
248         249            Harare    Zimbabwe     1750000                  712

[249 rows x 5 columns]

In [3]:
#Extract the unique values in designated column
df['Country'].unique()

array(['Argentina', 'Australia', 'Austria', 'Azerbaijan', 'Belgium',
       'Brazil', 'Cambodia', 'Canada', 'Chile', 'China', 'Colombia',
       'Congo', 'Denmark', 'Ecuador', 'Egypt', 'Finland', 'France',
       'Germany', 'Ghana', 'Greece', 'Hungary', 'India', 'Indonesia',
       'Iran', 'Iraq', 'Ireland', 'Israel', 'Italy', 'Japan', 'Kuwait',
       'Lebanon', 'Malaysia', 'Mexico', 'Netherlands', 'New Zealand',
       'Nigeria', 'Pakistan', 'Peru', 'Philippines', 'Poland', 'Portugal',
       'Puerto Rico', 'Russia', 'Saudi', 'Saudi Arabia', 'Singapore',
       'South Africa', 'South Korea', 'Spain', 'Sudan', 'Sweden',
       'Taiwan', 'Thailand', 'Turkey', 'UAE', 'UK', 'Ukraine', 'USA',
       'Uzbekistan', 'Vietnam', 'Zimbabwe'], dtype=object)

In [4]:
#Count each of the items
df['Country'].value_counts()

USA            105
France          15
Brazil          10
Canada           9
Germany          8
              ...
Austria          1
Sweden           1
New Zealand      1
Cambodia         1
Netherlands      1
Name: Country, Length: 61, dtype: int64

In [5]:
#View information
df['Country'].describe()

count     249
unique     61
top       USA
freq      105
Name: Country, dtype: object